Tekla Open API Reference for Tekla Structures 2025
AnalysisNode Methods
The AnalysisNode type exposes the following members.
Methods
Name | Description
Delete
 Deletes an analysis node. The ID has to be set.
GetAnalysisNodeLinks
 Get analysis nodelinks connected to node.
GetAnalysisParts
 Get analysis parts connected to node.
Insert
 Inserts an analysis node. The AnalysisModelName has to be set.
Modify
 Modifies an analysis node. The ID has to be set.
Select
 Selects an analysis node. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace